# Diameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSize..::..Diameter Property
WireSize Class See Also
---
Get diameter of wire.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Diameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Diameter As Double
	Get
```

Visual C++
---
```text
public:
property double Diameter {
	double get ();
}
```

# See Also
WireSize Class
Autodesk.Revit.DB.Electrical Namespace